
* Python function definitions
#+name: python_function_defintions
#+begin_src python :session Python :results table :hlines no :tangle yes
def read_file_to_string(fname):    
    with open(fname, "r") as file1:
        read_content = file1.read()
    return read_content

def write_string_to_file(fname,string):    
    with open(fname, "w") as file1:
        file1.write(string)

def dict_from_columns(ind1,ind2,table):
    fnames = {}
    for i in table:
        var=i[ind1]
        value=i[ind2]
        fnames[var]=value
    return fnames

def quote_lisp_library_text(mystring):
    lines = mystring.splitlines()
    fline2 = ""
    for line in lines:
        if line=="": continue
        fline1 = line.replace('"','\\"')
        fline = '\"' + fline1 + '\"'
        fline2 = fline2 + fline + "\n"
    return fline2[0:-1] + ";\n"
#+end_src

#+RESULTS: python_function_defintions
|   |

* File list
#+tblname: file_list
| id                   | filename            | status |                           |
|----------------------+---------------------+--------+---------------------------|
| driver               | arduino.org         | S      |                           |
| python_functions     | arduino.py          | STA    |                           |
| lisp_functions       | arduino.lisp        | T0     | inside string ends with ; |
| function_enums       | functions_enums.c   | T      | ends with,                |
| function_definitions | functions.c         | T      | function definitions      |
| function_names       | function_names.c    | T      | ends with a coma          |
| function_PROGMEM     | functions_PROGMEM.c | T      |                           |
| function_doc         | function_doc.c      | T      |                           |
| template             | ulisp.tmpl          | I      |                           |
| output               | ulisp.ino           | O      |                           |

#+name: h2
#+begin_src python :session Python :var inp=file_list :results table :hlines no
from string import Template
import os
exec(open("./arduino.py").read())
os.system('touch ulisp.ino')#+fnames['output'])
fnames = dict_from_columns(0,1,inp)
fstatus = dict_from_columns(0,2,inp)

fstrings = {}

for i in list(fnames.keys()):fstrings[i] = read_file_to_string(fnames[i])
# for i in list(fnames.keys()):
#     try:
#         if (fstatus[i]=='T'):
#             fstrings[i] = read_file_to_string(fnames[i])
#     except:
#         print(i)

template_string = Template(fstrings['template'])
unquoted_lisp_code = fstrings['lisp_functions']
quoted_lisp_code = quote_lisp_library_text(unquoted_lisp_code)
template_string1 = template_string.safe_substitute(lisp_functions=quoted_lisp_code)
template_string2 = Template(template_string1)
template_string3 = template_string2.safe_substitute(function_definitions=fstrings['function_definitions'])
template_string4 = Template(template_string3)
template_string5 = template_string4.safe_substitute(function_enums=fstrings['function_enums'])
template_string6 = Template(template_string5)
template_string7 = template_string6.safe_substitute(function_doc=fstrings['function_doc'])

#os.system('touch ulisp.ino')#+fnames['output'])
write_string_to_file(fnames['output'],template_string7)
os.system('mv '+fnames['output']+ " " + "./ulisp/"+fnames['output'])
#+end_src

#+RESULTS: h2
| 0 |

#+RESULTS: process_files
: None


#+name: format_template
#+begin_src python :session Python :var inp=file_list :results table :hlines no


#+end_src

** Use format for template
#+name: format_template
#+begin_src python :session Python :var inp=file_list :results table :hlines no
from string import Template
import os
exec(open("./arduino.py").read())
os.system('touch ulisp.ino')#+fnames['output'])
fnames = dict_from_columns(0,1,inp)
fstatus = dict_from_columns(0,2,inp)

fstrings = {}

for i in list(fnames.keys()):fstrings[i] = read_file_to_string(fnames[i])
# for i in list(fnames.keys()):
#     try:
#         if (fstatus[i]=='T'):
#             fstrings[i] = read_file_to_string(fnames[i])
#     except:
#         print(i)
#'Lat:{latitude} Lon:{longitude}'.format(**geopoint)

#template_string = Template(fstrings['template'])
template_string = fstrings['template']
unquoted_lisp_code = fstrings['lisp_functions']
quoted_lisp_code = quote_lisp_library_text(unquoted_lisp_code)
fstrings['lisp_functions'] = quoted_lisp_code

template_string7 = template_string.format(**fstrings)
#os.system('touch ulisp.ino')#+fnames['output'])
#write_string_to_file(fnames['output'],template_string7)
#os.system('mv '+fnames['output']+ " " + "./ulisp/"+fnames['output'])

#+end_src

#+RESULTS: format_template
|   |

* MPU-6050


#+tblname: MPU6050_address
| Device                           | address decimal | address hex |                             |
|----------------------------------+-----------------+-------------+-----------------------------|
| MPU6050 I2C Address              |             104 |        0x68 |                             |
| reset address                    |             107 |        0x6B | set 0                       |
| read accelaration (ACCEL_XOUT_H) |              59 |        0x3B | 6 bytes (XYZ_16bit_MSB/LSB) |
|----------------------------------+-----------------+-------------+-----------------------------|
| ACCEL_CONFIG register            |              28 |        0x1C | change scale                |
| set +/- 8g                       |              16 |        0x10 |                             |
|                                  |                 |             |                             |
#+TBLFM: @3$2='(format "%d" #x6B)::@4$2='(format "%d" #x3B)::@5$2='(format "%d" #x1C)::@6$2='(format "%d" #x10)

#+name: MPU_6050
#+begin_src lisp :tangle yes

(defun reset_MPU6050 ()
  (with-i2c (str #x69) 
    (write-byte #x6B str)
    (write-byte #x0 str)))

(defun MPU6050_readscale ()
  (with-i2c (str #x69) 
	    (write-byte #x1C str)
	    (restart-i2c str 1) 
	    (read-byte str)))

(defun MPU6050_readtemp ()
  "it is ok if temperature>36.5"
  (defvar tempout1 0)
  (defvar tempout2 0)
  (with-i2c (str #x69) 
	    (write-byte #x41 str)
	    (restart-i2c str 1) 
	    (setf tempout1 (read-byte str))
	    (write-byte #x42 str)
	    (restart-i2c str 1) 
	    (setf tempout2 (read-byte str))
	    )
  (format t "~x,~x~%" tempout1 tempout2))

(defun ct (tempout1 tempout2)
  (let ((temp 0))
    (if (= 1 (ash tempout1 -7))
	(setf temp (+ (/ tempout2 340.0) (* (- tempout1 256) (/ 256 340.0)) 36.53))
        (setf temp (+ (/ (logior (ash tempout1 8) tempout2) 340.0 ) 36.53) ))
    (format t "MPU_temp:~d~%" temp)
    ))
	
(defun checktemp (i j)
  (dotimes (p i) (delay j)
	   (MPU6050_readtemp)
	   (ct tempout1 tempout2)
	   (printbmptoserial)))

(defun MPU6050_setscale8g ()
  (with-i2c (str #x69) 
    (write-byte #x1C str)
    (write-byte #x10 str)))

(defun MPU6050_setscale2g ()
  (with-i2c (str #x69) 
    (write-byte #x1C str)
    (write-byte #x00 str)))

(defun read_MPU6050 ()
  (with-i2c (str #x69) 
    (write-byte #x3B str)
    (restart-i2c str 6) 
    (list (read-byte str) (read-byte str) (read-byte str) (read-byte str) (read-byte str) (read-byte str))))

(defun scan_MPU6050_long (i k) 
  (dotimes (p i)
    (delay k)
    (with-i2c (str #x69) 
      (write-byte #x3B str)
      )
    (let* ((r (read_MPU6050))
	   (x0 (nth 0 r))(x1 (nth 1 r))
	   (y0 (nth 2 r))(y1 (nth 3 r))
	   (z0 (nth 4 r))(z1 (nth 5 r)))
      (format t "~3d:: X:~3d:~3d  Y:~3d:~3d  Z:~3d:~3d~%" p x0 x1 y0 y1 z0 z1))))

(defun scan_MPU6050 () (format nil "~{ ~d ~}" (read_MPU6050)))

  #+end_src

* GY-271

(with-i2c (str #x68) 
  (write-byte 0 str) 
  (write-byte 1 str) 
  (write-byte 2 str))
  
(with-i2c (str 0x0D) 
(write-byte 0x0B str)
(write-byte 0x01 str)
(write-byte 0x09 str)
(write-byte 0x1D str)
)
  
(with-i2c (str 13) 
(write-byte 11 str)
(write-byte 1 str)
(write-byte 9 str)
(write-byte 29 str)
)

(with-i2c (str 13) 
(write-byte 0 str)
)


#+begin_src lisp
(defvar i 100)
(defun mag (i)
(if (< i 1) 0
(progn
(setf i (- i 1))
(prin1 (get_magneto))
(format t "~%")
(mag i)
))))
#+end_src

#+name: get_magneto
#+begin_src lisp :tangle yes
(defun get_magneto ()
  (with-i2c (str 13) 
	    (write-byte 0 str)
	    (restart-i2c str 6)
	    (list
	     (read-byte str)
	     (read-byte str)
	     (read-byte str)
	     (read-byte str)
	     (read-byte str)
	     (read-byte str))))
#+end_src

#+RESULTS: get_magneto
: get_magneto

#+begin_src emacs-lisp :var i=get_magneto
(format t i)
#+end_src 


#+name: hex2decimal
#+begin_src emacs-lisp :results table
(concat
(format "Compass|0x0D:|%d\n" #x0D)(format "||0x0B:|%d|\n" #x0B)(format "||0x1D:|%d|\n" #x1D)
(format "||0x68:|%d|" #x68)
)
#+end_src

#+RESULTS: hex2decimal
| Compass | 0x0D: |  13 |   |
|         | 0x0B: |  11 |   |
|         | 0x1D: |  29 |   |
|         | 0x68: | 104 |   |

#+name: decimal2hex
#+begin_src emacs-lisp
(concat
(format "0x0D:%d\n" #x0D)
(format "0x0B:%d\n" #x0B)
(format "0x1D:%d" #x1D)
)
#+end_src

#+RESULTS:
: 0x0D:13
: 0x0B:11
: 0x1D:29

(defun get ()
  (with-i2c (str 13 3) 
    (list
     (read-byte str)
     (read-byte str)
     (read-byte str))))


* code runs by table variables

#+tblname: s_9000_0
|    |      |
|----+------|
| S1 | 10.0 |
| S2 | 30.0 |
| S3 | 40.0 |

#+name: s_9000_2
#+begin_src lisp :var inp = s_9000_0 

(setf w
(loop for i in inp
      collect (let ((var (intern (car i)))
		    (val (cadr i)))
		(list 'setq var val))))

(loop for i in w
      collect (eval i))

(list (list "S1" " " s1)
      (list "S2" " " s2)
      (list "S3" " " s3)
      (list "S4" "(setq s4 (+ s1 s2)) " (setq s4 (+ s3 s2))))
#+end_src

#+RESULTS: s_9000_2
| S1 |                     | 10.0 |
| S2 |                     | 30.0 |
| S3 |                     | 40.0 |
| S4 | (setq s4 (+ s1 s2)) | 70.0 |


